Revit 2026 API

# XYZBasisX Property

---

The basis of the X axis.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ BasisX { get; }
```
```vb
Public Shared ReadOnly Property BasisX As XYZ
	Get
```
```cpp
public:
static property XYZ^ BasisX {
	XYZ^ get ();
}
```
```fsharp
static member BasisX : XYZ with get
```

#### Property Value

XYZ

The basis of the X axis is the vector (1,0,0), the unit vector on the X axis.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace